{
    "php_version": {
        "current": "8.2.12",
        "required": "7.4.0",
        "status": "PASS"
    },
    "extensions": {
        "pdo": true,
        "pdo_mysql": true,
        "mysqli": true,
        "json": true,
        "session": true,
        "fileinfo": true,
        "gd": false
    },
    "php_settings": {
        "memory_limit": "512M",
        "max_execution_time": "120",
        "display_errors": "1",
        "error_reporting": "32767",
        "upload_max_filesize": "40M",
        "post_max_size": "40M"
    },
    "file_permissions": {
        "Main directory": {
            "exists": true,
            "readable": true,
            "writable": true,
            "path": "D:\\xampp\\htdocs\\restaurant-menu-system"
        },
        "Includes directory": {
            "exists": true,
            "readable": true,
            "writable": true,
            "path": "D:\\xampp\\htdocs\\restaurant-menu-system\/includes"
        },
        "Application directory": {
            "exists": true,
            "readable": true,
            "writable": true,
            "path": "D:\\xampp\\htdocs\\restaurant-menu-system\/app"
        },
        "Debug directory": {
            "exists": true,
            "readable": true,
            "writable": true,
            "path": "D:\\xampp\\htdocs\\restaurant-menu-system\/debug"
        },
        "Themes directory": {
            "exists": true,
            "readable": true,
            "writable": true,
            "path": "D:\\xampp\\htdocs\\restaurant-menu-system\/themes"
        },
        "Public directory": {
            "exists": true,
            "readable": true,
            "writable": true,
            "path": "D:\\xampp\\htdocs\\restaurant-menu-system\/public"
        }
    },
    "class_verification": {
        "summary": {
            "total_classes": 23,
            "loaded_classes": 23,
            "failed_classes": 0,
            "missing_files": 0,
            "success_rate": 100
        },
        "classes": {
            "Config": {
                "class_name": "Config",
                "file_path": "\/includes\/config\/Config.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 5142,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Database": {
                "class_name": "Database",
                "file_path": "\/includes\/database\/Database.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 2968,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Session": {
                "class_name": "Session",
                "file_path": "\/includes\/session\/Session.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 3610,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Auth": {
                "class_name": "Auth",
                "file_path": "\/includes\/auth\/Auth.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 11984,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Theme": {
                "class_name": "Theme",
                "file_path": "\/includes\/theme\/Theme.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 7712,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "AddonManager": {
                "class_name": "AddonManager",
                "file_path": "\/includes\/addon\/AddonManager.php",
                "required": false,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 13600,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Application": {
                "class_name": "Application",
                "file_path": "\/app\/core\/Application.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 6148,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Router": {
                "class_name": "Router",
                "file_path": "\/app\/core\/Router.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 8732,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Controller": {
                "class_name": "Controller",
                "file_path": "\/app\/core\/Controller.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 10456,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "Model": {
                "class_name": "Model",
                "file_path": "\/app\/core\/Model.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 6303,
                "file_readable": true,
                "class_exists": true,
                "dependencies": []
            },
            "User": {
                "class_name": "User",
                "file_path": "\/app\/models\/User.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 8463,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Model"
                }
            },
            "Branch": {
                "class_name": "Branch",
                "file_path": "\/app\/models\/Branch.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 7765,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Model"
                }
            },
            "Table": {
                "class_name": "Table",
                "file_path": "\/app\/models\/Table.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 9920,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Model"
                }
            },
            "QRCode": {
                "class_name": "QRCode",
                "file_path": "\/app\/models\/QRCode.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 9918,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Model"
                }
            },
            "ActivityLog": {
                "class_name": "ActivityLog",
                "file_path": "\/app\/models\/ActivityLog.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 7056,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Model"
                }
            },
            "HomeController": {
                "class_name": "HomeController",
                "file_path": "\/app\/controllers\/HomeController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 575,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            },
            "AuthController": {
                "class_name": "AuthController",
                "file_path": "\/app\/controllers\/AuthController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 12984,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            },
            "DashboardController": {
                "class_name": "DashboardController",
                "file_path": "\/app\/controllers\/DashboardController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 2258,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            },
            "BranchController": {
                "class_name": "BranchController",
                "file_path": "\/app\/controllers\/BranchController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 1016,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            },
            "MenuController": {
                "class_name": "MenuController",
                "file_path": "\/app\/controllers\/MenuController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 3834,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            },
            "OrderController": {
                "class_name": "OrderController",
                "file_path": "\/app\/controllers\/OrderController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 7401,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            },
            "QRController": {
                "class_name": "QRController",
                "file_path": "\/app\/controllers\/QRController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 10600,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            },
            "ApiController": {
                "class_name": "ApiController",
                "file_path": "\/app\/controllers\/ApiController.php",
                "required": true,
                "status": "loaded",
                "error": null,
                "file_exists": true,
                "file_size": 8260,
                "file_readable": true,
                "class_exists": true,
                "dependencies": {
                    "parent": "Controller"
                }
            }
        },
        "critical_issues": [],
        "recommendations": []
    },
    "dependency_analysis": {
        "analysis": {
            "total_classes": 23,
            "loading_order_valid": true,
            "circular_dependencies": [],
            "missing_dependencies": [],
            "class_status": {
                "Config": {
                    "class_name": "Config",
                    "dependencies": [],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Database": {
                    "class_name": "Database",
                    "dependencies": [
                        "Config"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Session": {
                    "class_name": "Session",
                    "dependencies": [
                        "Config"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Auth": {
                    "class_name": "Auth",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Session"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Theme": {
                    "class_name": "Theme",
                    "dependencies": [
                        "Config"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "AddonManager": {
                    "class_name": "AddonManager",
                    "dependencies": [
                        "Config"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Router": {
                    "class_name": "Router",
                    "dependencies": [
                        "Config"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Application": {
                    "class_name": "Application",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Session",
                        "Auth",
                        "Theme",
                        "AddonManager",
                        "Router"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Model": {
                    "class_name": "Model",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Application"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Controller": {
                    "class_name": "Controller",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Model"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "User": {
                    "class_name": "User",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Model"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Branch": {
                    "class_name": "Branch",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Model"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "Table": {
                    "class_name": "Table",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Model"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "QRCode": {
                    "class_name": "QRCode",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Model"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "ActivityLog": {
                    "class_name": "ActivityLog",
                    "dependencies": [
                        "Config",
                        "Database",
                        "Model"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "HomeController": {
                    "class_name": "HomeController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller",
                        "Branch"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "AuthController": {
                    "class_name": "AuthController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller",
                        "User"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "DashboardController": {
                    "class_name": "DashboardController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "BranchController": {
                    "class_name": "BranchController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller",
                        "Branch"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "MenuController": {
                    "class_name": "MenuController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "OrderController": {
                    "class_name": "OrderController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "QRController": {
                    "class_name": "QRController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller",
                        "QRCode"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                },
                "ApiController": {
                    "class_name": "ApiController",
                    "dependencies": [
                        "Config",
                        "Application",
                        "Controller"
                    ],
                    "dependencies_satisfied": true,
                    "missing_dependencies": [],
                    "loaded": true,
                    "loadable": true
                }
            },
            "recommendations": []
        },
        "optimal_loading_order": [
            "Config",
            "Database",
            "Session",
            "Auth",
            "Theme",
            "AddonManager",
            "Router",
            "Application",
            "Model",
            "Controller",
            "User",
            "Branch",
            "Table",
            "QRCode",
            "ActivityLog",
            "HomeController",
            "AuthController",
            "DashboardController",
            "BranchController",
            "MenuController",
            "OrderController",
            "QRController",
            "ApiController"
        ],
        "current_loading_order": [
            "Config",
            "Database",
            "Session",
            "Auth",
            "Theme",
            "AddonManager",
            "Router",
            "Application",
            "Model",
            "Controller",
            "User",
            "Branch",
            "Table",
            "QRCode",
            "ActivityLog",
            "AuthController",
            "QRController",
            "HomeController",
            "DashboardController",
            "BranchController",
            "MenuController",
            "OrderController",
            "ApiController"
        ],
        "order_validation": {
            "is_valid": true,
            "issues": [],
            "optimized_order": [
                "Config",
                "Database",
                "Session",
                "Auth",
                "Theme",
                "AddonManager",
                "Router",
                "Application",
                "Model",
                "Controller",
                "User",
                "Branch",
                "Table",
                "QRCode",
                "ActivityLog",
                "HomeController",
                "AuthController",
                "DashboardController",
                "BranchController",
                "MenuController",
                "OrderController",
                "QRController",
                "ApiController"
            ]
        },
        "system_health": {
            "score": 100,
            "status": "excellent",
            "issues": []
        }
    }
}